tap "gromgit/fuse"
tap "homebrew/bundle"
tap "timescale/tap"
# TIFF library and utilities
brew "libtiff"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# High performance message passing library
brew "open-mpi"
# Parser generator
brew "bison"
# (Arguably) the best yacc variant
brew "byacc"
# Cross-platform make
brew "cmake"
# Shell script to build fancy DMGs
brew "create-dmg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Text-based web browser
brew "lynx"
# Run a Kubernetes cluster locally
brew "minikube"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# High-level interpreted language for numerical computing
brew "octave"
# Implementation of the OpenAL 3D audio API
brew "openal-soft"
# Python package management tool
brew "poetry"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Rednex GameBoy Development System
brew "rgbds"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal multiplexer
brew "tmux"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# An open-source time-series database optimized for fast ingest and complex queries. Fully compatible with PostgreSQL.
brew "timescale/tap/timescaledb"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# File system integration
cask "macfuse"
